app/views/users/show.html.erb

SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 1
---
<h2>post list</h2>
<% @user.posts.each do |p| %>