app/views/posts/index.html.erb

SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN (1)) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id ORDER BY count DESC
---
                <a href="/users/<%= p.user.id %>"><%= p.user.name %></a>
                <% p.tag_list.each do |tag| %>

SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` IN (1, 2, 3)
SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 2
---
                <%= link_to post_like_path(id: p.id, post_id: p.id), method: :delete do %>
                    <i class="fas fa-heart"></i><%= p.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 1
---
                <%= link_to post_likes_path(id: p.id, post_id: p.id), method: :post do %>
                    <i class="far fa-heart"></i><%= p.likes.count %>