app/views/posts/show.html.erb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 9
---
    <%= link_to post_like_path(@post), method: :delete do %>
    <i class="fas fa-heart"></i><%= @post.likes.count %>

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 25
---
    <%= link_to post_likes_path(@post), method: :post do %>
    <i class="far fa-heart"></i><%= @post.likes.count %>

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
    <div>
        <%= c.user.name unless c.user.blank? %>