app/controllers/comments_controller.rb

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = NULL LIMIT 1
INSERT INTO `comments` (`comment`, `created_at`, `updated_at`, `post_id`, `user_id`) VALUES ('テスト', '2020-11-05 08:21:22.619176', '2020-11-05 08:21:22.619176', 9, 3)
---
    def create
        post = Post.find(params[:post_id])
        comment = post.comments.build(comment_params)
        comment.user_id = current_user.id
        if comment.save