app/controllers/likes_controller.rb

  def create
    like = current_user.likes.create(post_id: params[:post_id]) #user_idとpost_idの二つを代入
---
INSERT INTO `likes` (`post_id`, `user_id`, `created_at`, `updated_at`) VALUES (2, 4, '2020-11-27 08:01:48.667672', '2020-11-27 08:01:48.667672')

  def destroy
   like = Like.find_by(post_id: params[:post_id], user_id: current_user.id)
   like.destroy
---
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` = 2 AND `likes`.`user_id` = 4 LIMIT 1
DELETE FROM `likes` WHERE `likes`.`id` = 1