app/controllers/posts_controller.rb

SELECT COUNT(*) FROM `likes` WHERE `likes`.`post_id` = 7
SELECT COUNT(*) FROM `posts`
SELECT COUNT(*) FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`post_id` = 7
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` IN (5, 6, 7, 8)
SELECT tags.*, taggings.tags_count AS count FROM `tags` JOIN (SELECT taggings.tag_id, COUNT(taggings.tag_id) AS tags_count FROM `taggings` WHERE (taggings.taggable_type = 'Post' AND taggings.context = 'tags') AND (taggings.taggable_id IN (1)) GROUP BY taggings.tag_id HAVING (COUNT(taggings.tag_id) > 0)) AS taggings ON taggings.tag_id = tags.id ORDER BY count DESC
SELECT COUNT(*) FROM `users` INNER JOIN `likes` ON `users`.`id` = `likes`.`user_id` WHERE `likes`.`post_id` = 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (1, 3)
SELECT posts.id FROM `posts`
SELECT COUNT(*) FROM (SELECT 1 AS one FROM `posts` LIMIT 3 OFFSET 0) subquery_for_count
SELECT `likes`.* FROM `likes` WHERE `likes`.`post_id` IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15)
SELECT `posts`.* FROM `posts`
---
    def index
        posts = Post.includes(:liked_users).sort {|a,b| b.liked_users.size <=> a.liked_users.size}
        if params[:search] == nil
            @posts= Kaminari.paginate_array(posts).page(params[:page]).per(3)
          elsif params[:search] == ''
            @posts= Kaminari.paginate_array(posts).page(params[:page]).per(3)
          else
            @posted = Post.tagged_with(params[:search], :wild => true, :any => true).includes(:liked_users).sort {|a,b| b.liked_users.size <=> a.liked_users.size}
            @posts= Kaminari.paginate_array(@posted).page(params[:page]).per(3)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 1 LIMIT 1
UPDATE `posts` SET `posts`.`image` = 'IMG_1471.JPG', `posts`.`updated_at` = '2020-11-28 04:12:18.723252' WHERE `posts`.`id` = 2
---
    def update
        post = Post.find(params[:id])
        if post.update(post_params)

SELECT `posts`.* FROM `posts` WHERE `posts`.`id` = 2 LIMIT 1
DELETE FROM `posts` WHERE `posts`.`id` = 2
---
    def destroy
        post = Post.find(params[:id])

        if post.user_id == current_user.id
            post.destroy

INSERT INTO `posts` (`created_at`, `updated_at`, `tent`, `sleep`, `lantan`, `cook`, `other`, `title`, `advice`, `number`, `price`, `about`, `user_id`) VALUES ('2020-12-03 09:28:23.018513', '2020-12-03 09:28:23.018513', '', '', '', '', '', '', '', 0, '', '', 1)
---
    def create
        post = Post.new(post_params)

        post.user_id = current_user.id

        if post.save