app/controllers/users_controller.rb

   def show
      @user = User.find(params[:id])
      @posts = @user.posts.page(params[:page]).per(12)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`user_id` = 3

   def follow
      @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 ORDER BY `users`.`id` ASC LIMIT 1

   def unfollow
      @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

   def follow_list
   @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

   def follower_list
   @user = User.find(params[:user_id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1