app/models/user.rb

  def already_liked?(post)
    self.likes.exists?(post_id: post.id)
---
SELECT 1 AS one FROM `likes` WHERE `likes`.`user_id` = 3 AND `likes`.`post_id` = 7 LIMIT 1